{
  "subuh": [
    "Abu Huraira reported that Allah's Messenger said, \"When the heat is severe postpone the Salah till it is cooler because the severity of heat is the effect of the violence of Hell.\" [Bukhari 536, Muslim 615]",
    "Rafi bin Khadij said that he heard Allah's Messenger (SAW) say, \"Offer the Fajr Salah in good light. There is more reward in that.\" [Ahmed 17280, Abu Dawud 424, Nisai 547]",
    "Aisha narrated that when Allah's Messenger (SAW) would finish the Fajr Salah, the women would return.\" Ansari added, \"And they would pass wrapped in cloaks unrecognized because of the darkness.\" [Muslim 465, Bukhari 578]",
    "Um Salama said, \"Allah's Messenger (SAW) used to hasten the zuhr more than you do but you observe the Asr earlier than he did.\" [Ahmed 26540]",
    "Ibn Abbas said, \"I heard from many Sahaba (RA) among whom is Umar ibn al-Khattab who is the dearest to me that Allah's Messenger (SAW) disallowed us to offer Salah after Fajr till the sun had risen and after Asr till the sun had set.\" [Bukhari 581, Muslim 826]"
  ],
  "duhr": [
    "Hasan ibn Ali Halwani reported to us, Abdur Razzaq reported to him and Mu'mar to him and Zuhri to him. Sayyidina Anas ibn Malik told me that Allah's Messenger offered the Salah of zuhr when it was time of zawal (declination of the sun).",
    "Aisha said, \"I did not see anyone offering the Salah of Zuhr earlier than Allah's Messenger (SAW) did, and not even (earlier) than Abu Bakr and Umar (RA).\" [Ahmed 25092]",
    "Jabir bin Abdullah reported from Allah's Messenger (SAW) said, \"Jibril led me in Salah.\" And he mentioned a Hadith of the same purport as Sayyidina Abbas (RA)(Hadith #149), saying (about Zuhr) \"at the time of Asr yesterday.\" [Ahmed 14545, Nisai 522]",
    "Abu Said reported that Allah's Messenger (SAW) said, \"When you hear the adhan, say just as the muadhdhin says.\" [Bukhari 611, Muslim 383]"
  ],
  "ashr": [
    "Aisha said that Allah's Messenger (SAW) prayed the Salah while the sun was still in her room and the shadow had not gone up in her room. [Ahmed 24150, 546, Muslim 611, Abu Dawud 407]",
    "Ibn Umar said that Allah's Messenger,(SAW) said, \"There lies in earliest time of Salah pleasure of Allah while the concluding time is His grant.",
    "Ibn Umar that the Prophet (SAW) said, \"If anyone misses the Salah of Asr, it is as though he has lost his family and property.\" [Ahmed 4545, M626, Abu Dawud 414, Nisai 504, B552, Ibn e Majah 685]",
    "Anas that Allah's Messenger (SAW) said, \"If anyone forgets to offer salah then he must offer it on remembering it.\" [Ahmed 13550, 8597, Muslim 684]",
    "Abdullah bin Masud narrated that Allah's Messenger (SAW) said, \"Salat ul-wusta is the Salah of Asr.\" [Ahmed 3716, Muslim 628, Ibn e Majah 686]"
  ],
  "maghrib": [
    "Salamah ibn al-Aku said that Allah's Messenger (SAW) offered the Salah of Maghrib when the sun had set and hid itself behind the screen. [Ahmed 16532, Bukhari 561, Muslim 636, Abu Dawud 417, Ibn e Majah 688]",
    "Abu Mahdhurah said that the Prophet (SAW) taught him nineteen words of the Adhan and seventeen of the iqamah. [Ahmed 15377, Muslim 379]",
    "Malik bin Huwairth narrated that he visited Allah's Messenger (SAW) with his cousin. He said to them, \"When you two travel, call the adhan and the iqamah and the elder should lead the salah.\" [Ahmed 15601, Bukhari 628]"
  ],
  "isya": [
    "Numan ibn Bashir said, \"I know more then all people the hour of this Salah. Allah's Messenger (SAW) used to observe it at the time of the setting of the moon on its third night.\" [Ahmed 18405, Abu Dawud 419, Nisai 527]",
    "Abu Huraira reported that Allah's Messenger (SAW) said, \"Were it not that my Ummah would be destressed by it, I would have them to postpone the Salah of Isha to a third or half of the night.\" [Ahmed 7416, Ibn e Majah 691]",
    "Abu Barza narrated that the Prophet (SAW) disliked sleeping before Isha and talking after it. [Ahmed 19788, Muslim 647, Bukhari 540]",
    "Uthman ibn Abdul Aas narrated that the last instruction of Allah's Messenger (SAW) to him was that he should select a muadhdhin who would not seek wages against the adhan he called. [Ahmed 17926, Abu Dawud 531, Nisai 671]"
  ]
}
